// task 1 ==========================================================================================================================
// ОГОЛОШЕННЯ ЗМІННИХ
/* <ключове слово> <назва змінної> = <значення></значення> */
// Створення змінної без ключового слова const призведе до помилки.

// ----------------------------------------------------------------------
// console.log(productName);
// const productName = 'Droid';

// console.log(pricePerItem);
// const pricePerItem = 2000;
// ----------------------------------------------------------------------

// task 2 =========================================================================================================================
// ПЕРЕВИЗНАЧЕННЯ ЗНАЧЕННЯ ЗМІННОЇ
// ключове слово let.
// Створення змінної без ключового слова let або const призведе до помилки.

// example:
// let age = 5;
// age = 10;

// let username = "Mango";
// username = "Poly";

// Спроба звернутися до змінної за ім'ям до її оголошення, викличе помилку.
// example:
// >>>>> НЕПРАВИЛЬНО, буде помилка
// age = 15; // ReferenceError: Cannot access 'age' before initialization
// console.log(age); // ReferenceError: age is not defined

// >>>>> Оголошення змінної age
// let age = 20;

// >>>>> ПРАВИЛЬНО, звертаємося після оголошення
// age = 25;
// console.log(age);

// description on the task
// Ім'я товару змінили на "Repair droid" і збільшили його ціну на 1500
// кредитів.Перевизнач значення змінних pricePerItem і productName після їх оголошення.

// ----------------------------------------------------------------------
// let productName = "Droid";
// let pricePerItem = 2000;

// productName = "Repair droid";
// pricePerItem = 3500;
// ----------------------------------------------------------------------

// task 3 =========================================================================================================================
// ТИПИ ПРИМІТИВІВ (ЧИСЛА, РЯДКИ, БУЛІ)
// >>>Number - цілі числа і числа з плаваючою комою (крапкою).
// >>>String - рядки, послідовність від нуля або більше символів.
//  Рядок починається і закінчується одинарною ' або подвійними лапками ".
// >>>Boolean - логічний тип даних, прапорці стану. Всього два значення: true і false.
// Наприклад, на питання, чи увімкнено світло в кімнаті, можна відповісти так(true) або ні(false).

// example:
// Числа
// const age = 20;
// const salary = 3710.84;

// // Рядки
// const name = "Mango";
// const description = "JavaSript essentials";

// // Булі
// const isModalOpen = true;
// const isLoggedIn = false;

// description on the task
// Оголоси наступні змінні, використовуючи ключове слово const або let, і присвой їм відповідні значення.
// topSpeed - число 160.
// distance - число 617.54.
// login - рядок "mango935".
// isOnline - буль true.
// isAdmin - буль false.
// ----------------------------------------------------------------------
// const topSpeed = 160;
// const distance = 617.54;
// const login = "mango935";
//  const isOnline = true;
//  const isAdmin = false;
// ----------------------------------------------------------------------

// task 4 =========================================================================================================================
// МАТЕМАТИЧНІ ОПЕРАТОРИ
// Оператори повертають значення як результат виразу.
// >>>>> Важливо запам'ятати правильне іменування складових алгебраїчного виразу:
// +, -, * і / називаються операторами, а те, на чому вони застосовуються(числа) - операнди.

// example:
// const x = 10;
// const y = 5;

// // Додавання
// console.log(x + y); // 15

// // Віднімання
// console.log(x - y); // 5

// // Множення
// console.log(x * y); // 50

// // Ділення
// console.log(x / y); // 2

// description on the task
// Доповни код, присвоївши змінній totalPrice вираз для підрахунку загальної суми замовлення.
// Змінна pricePerItem зберігає ціну однієї одиниці товару, а orderedQuantity - кількість одиниць товару в замовленні.

// ----------------------------------------------------------------------
// const pricePerItem = 3500;
// const orderedQuantity = 4;

// const totalPrice = pricePerItem * orderedQuantity;
// ----------------------------------------------------------------------

// task 5 =========================================================================================================================
// ШАБЛОННІ РЯДКИ
// Шаблонний рядок береться у зворотні (скісні) лапки, замість подвійних або одинарних,
//  і може містити місцезаповнювачі, які позначаються знаком долара і фігурними дужками - ${ вираз }.

// example:
// const guestName = "Mango";
// const roomNumber = 207;
// const greeting = `Ласкаво просимо ${guestName}, ви заселені у номер ${roomNumber}`;

// description on the task
// Оголоси змінну message і запиши в неї повідомлення про покупку, рядок у форматі:
// "You picked <назва товару>, price per item is <ціна товару> credits".
//     Де < назва товару > і < ціна товару > — це значення змінних productName і pricePerItem.
//     Використовуй синтаксис шаблонних рядків.

// ----------------------------------------------------------------------
// const productName = "Droid";
// const pricePerItem = 3500;
// const message = "You picked Droid, price per item is 3500 credits"
// ----------------------------------------------------------------------
